#include <REGX52.H>

/**
   *@brief  定时器0初始化，1毫秒@11.0592MHz
   *@param  无
   *@retval 无
   */

void Timer0_Init(void)		//1毫秒@11.0592MHz，定时器0初始化函数，通过配置寄存器实现相关操作
{
	TMOD &= 0xF0;			//设置定时器模式，高4位不变，低4位置零
	TMOD |= 0x01;			//设置定时器模式，高4位不变，低4位置1
	
	TL0 = 0x66;				//设置定时初始值，高8位
	TH0 = 0xFC;				//设置定时初始值，低8位
	                        //高4位控制T1：0000，低4位控制T0：0001
	                        //GATE = 0；C/T = 0（定时）；M1M0 = 01（模式1）	
	TF0 = 0;				//清除TF0标志
	TR0 = 1;				//定时器0开始计时，启动T0定时器
		
	EA = 1;                 //总中断允许
	ET0 = 1;                //定时器0中断允许
	PT0 = 0;                //低优先级
}

/*定时器中断函数模板
void Timer0_Routine() interrupt 1  //定时器0中断函数 中断关键字
{
	static unsigned int T0Count;    //静态变量，断电不丢失
	T0Count++;
	TL0 = 0x66;
	TH0 = 0xFC;	           //重新赋初值
	if(T0Count >= 1000)            //判断1s,不能写成 == 1000，中断可能被打断，计数跳过1000
	{
		T0Count = 0;
	}
}
*/
